In [1]:
import pandas as pd

In [3]:
file_path = "Resources/shopping_data.csv"
shopping_df = pd.read_csv(file_path, encoding= "ISO-8859-1")
shopping_df.head(5)

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [4]:
# columns
shopping_df.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [6]:
#find types
shopping_df.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [7]:
for column in shopping_df.columns:
    print(f"Column{column} has {shopping_df[column].isnull().sum()}null values")

ColumnCustomerID has 0null values
ColumnCard Member has 2null values
ColumnAge has 2null values
ColumnAnnual Income has 0null values
ColumnSpending Score (1-100) has 1null values

In [9]:
# Drop null rows
shopping_df =shopping_df.dropna()
shopping_df

     CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0             1         Yes  19.0          15000                    39.0
1             2         Yes  21.0          15000                    81.0
2             3          No  20.0          16000                     6.0
3             4          No  23.0          16000                    77.0
4             5          No  31.0          17000                    40.0
..          ...         ...   ...            ...                     ...
198         199          No  35.0         120000                    79.0
199         200          No  45.0         126000                    28.0
200         201         Yes  32.0         126000                    74.0
201         202         Yes  32.0         137000                    18.0
202         203         Yes  30.0         137000                    83.0

[200 rows x 5 columns]

In [10]:
# find duplicate entries
print(f"Duplicate entries: {shopping_df.duplicated().sum()}")

Duplicate entries: 0

In [11]:
shopping_df.drop(columns=["CustomerID"], inplace = True)
shopping_df.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [12]:
# transfrom string column
def change_string(member):
    if member== "Yes":
        return 1
    else:
        return 0
shopping_df["Card Member"] = shopping_df["Card Member"].apply(change_string)
shopping_df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [13]:
# transform annual income
shopping_df["Annual Income"] = shopping_df["Annual Income"] / 1000
shopping_df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [17]:
# rename columns
shopping_df = shopping_df.rename(columns={'Card Member': 'card_member', 'Age': 'age', 'Annual Income' : 'annual_income', 'Spending Score (1-100)':'spending_score'})
# Or rename the existing DataFrame (rather than creating a copy) 
shopping_df.rename(columns={'Card Number': 'card_number', 'Age': 'age', 'Annual Income' : 'annual_income', 'Spending Score (1-100)':'spending_score'}, inplace=True)
shopping_df.head()

   card_member   age  annual_income  spending_score
0            1  19.0           15.0            39.0
1            1  21.0           15.0            81.0
2            0  20.0           16.0             6.0
3            0  23.0           16.0            77.0
4            0  31.0           17.0            40.0

In [18]:
# Saving cleaned data
file_path = "Resources/shopping_data_cleaned.csv"
shopping_df.to_csv(file_path, index=False)